<?php

namespace Database\Seeders;

use App\Models\Post;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //


        // ? создание 10 рандомных постов
        $num = 1;
        for ($i = 0; $i < 10; $i++) {

            $post = [

                'title' => [
                    'uk' => $num . ' сервіс',
                    'ru' => $num . ' сервис',
                ],
                'slug' => [
                    'uk' => 'servis-ukrayini',
                    'ru' => 'servis-ukrainy',
                ],

                'description' => [
                    'uk' => 'Україна (укр. Україна, МФА: [ʊkrɐˈjinɐ]про файл) — держава у Східній та Центральній Європі. Населення - 40 997 699 постійних жителів та 41 167 336 осіб готівкового населення [6] (34-е місце у світі). Загальна площа - 603 549 км ² (44-е місце у світі); найбільша за площею держава, що повністю перебуває в Європі.',
                    'ru' => 'Украина (укр. Украина, МФА: [ʊkrɐˈjinɐ]о файле) — государство в Восточной и Центральной Европе. Население – 40 997 699 постоянных жителей и 41 167 336 человек наличного населения [6] (34-е место в мире). Общая площадь – 603 549 км² (44-е место в мире); крупнейшее по площади государство, полностью находящееся в Европе.',
                ],
                'views' => rand(100, 10000),
                'image' => 'images/blog/01.png',
                'image_min' => 'images/blog/01.png',
                'alt_image' => 'Alt image',

                'body' => [
                    'uk' => 'Україна (укр. Україна, МФА: [ʊkrɐˈjinɐ]про файл) — держава у Східній та Центральній Європі. Населення - 40 997 699 постійних жителів та 41 167 336 осіб готівкового населення [6] (34-е місце у світі). Загальна площа - 603 549 км ² (44-е місце у світі); найбільша за площею держава, що повністю перебуває в Європі.',
                    'ru' => 'Украина (укр. Украина, МФА: [ʊkrɐˈjinɐ]о файле) — государство в Восточной и Центральной Европе. Население – 40 997 699 постоянных жителей и 41 167 336 человек наличного населения [6] (34-е место в мире). Общая площадь – 603 549 км² (44-е место в мире); крупнейшее по площади государство, полностью находящееся в Европе.',
                ],
                'published' => rand(0, 1) == 1,
                'slider' => rand(0, 1) == 1,
            ];

            Post::create($post);

            $num += 1;
        }
    }
}