<?php

namespace Database\Seeders;

use App\Models\ServiceCategory;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServiceCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
        // ? создание категорий для сервисов
        $categories = [
            [

                'name' => [
                    'uk' => 'Кращий рейтинг',
                    'ru' => 'Лучший рейтинг',
                ],
                'title' => [
                    'uk' => 'T-рейтинг кредитних сервісів',
                    'ru' => 'T-рейтинг кредитных сервисов',
                ],
                'description' => [
                    'uk' => '<p>T-рейтинг постійно оновлюється штучним інтелектом на основі багатьох факторів (таких як рівень погодження заявок, час прийняття рішення, вартість кредиту, відгуки позичальників та популярність сервісу)</p>',
                    'ru' => '<p>T-рейтинг постоянно обновляется искусственным интеллектом на основе многих факторов (таких как согласование заявок, время принятия решения, стоимость кредита, отзывы заемщиков и популярность сервиса)</p>',
                ],
                'slug' => 'f-rating',
            ],
            [

                'name' => [
                    'uk' => 'Краще схвалення',
                    'ru' => 'Лучшее одобрение',
                ],
                'title' => [
                    'uk' => 'Рейтинг T-схвалення кредитних сервісів',
                    'ru' => 'Рейтинг T-одобрения кредитных сервисов',
                ],
                'description' => [
                    'uk' => '<p>Високий показник T-схвалення означає високу вирогідність погодження кредиту</p>',
                    'ru' => '<p>Высокий показатель T-одобрения означает высокую вероятность согласования кредита</p>',
                ],
                'slug' => 'f-approve',
            ],
            [

                'name' => [
                    'uk' => 'Краща вартість',
                    'ru' => 'Лучшая стоимость',
                ],
                'title' => [
                    'uk' => 'Рейтинг T-вартість кредитних сервісів',
                    'ru' => 'Рейтинг T-стоимость кредитных сервисов',
                ],
                'description' => [
                    'uk' => '<p>Високий показник T-варість означає кредитний сервіс має менші відсоткові ставки</p>',
                    'ru' => '<p>Высокий показатель T-варость означает кредитный сервис имеет меньшие процентные ставки</p>',
                ],
                'slug' => 'f-cost',
            ],
        ];

        foreach ($categories as $category) {
            $data = [
                'name' => $category['name'],
                'title' => $category['title'],
                'description' => $category['description'],
                'slug' => $category['slug'],
            ];

            ServiceCategory::create($data);
        }
    }
}
